v1_chunked_prefill/online-0.9util-TPparallel1_run.log
[W715 23:03:52.559616296 OperatorEntry.cpp:154] Warning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: aten::geometric_(Tensor(a!) self, float p, *, Generator? generator=None) -> Tensor(a!)
    registered at /pytorch/build/aten/src/ATen/RegisterSchema.cpp:6
  dispatch key: XPU
  previous kernel: registered at /pytorch/aten/src/ATen/VmapModeRegistrations.cpp:37
       new kernel: registered at /build/intel-pytorch-extension/build/Release/csrc/gpu/csrc/gpu/xpu/ATen/RegisterXPU_0.cpp:186 (function operator())
INFO 07-15 23:03:53 [__init__.py:253] Automatically detected platform xpu.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=18080, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path='benchmarks/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=64, model='/model/meta-llama/Llama-2-7b-chat-hf', tokenizer=None, use_beam_search=False, num_prompts=1024, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 1024/1024 [03:21<00:00,  5.09it/s]
============ Serving Benchmark Result ============
Successful requests:                     1024      
Benchmark duration (s):                  201.17    
Total input tokens:                      254149    
Total generated tokens:                  197765    
Request throughput (req/s):              5.09      
Output token throughput (tok/s):         983.06    
Total Token throughput (tok/s):          2246.39   
---------------Time to First Token----------------
Mean TTFT (ms):                          197.73    
Median TTFT (ms):                        125.14    
P99 TTFT (ms):                           1697.74   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          60.42     
Median TPOT (ms):                        59.17     
P99 TPOT (ms):                           115.64    
---------------Inter-token Latency----------------
Mean ITL (ms):                           58.33     
Median ITL (ms):                         54.04     
P99 ITL (ms):                            127.63    
==================================================